blog/2020/add-multiple-github-accounts.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-12-03 Fri 11:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>为本地添加多个 GitHub 账户</title>
<meta name="generator" content="Org mode">
<meta name="description" content="Learn Technology, Love Life"
>
<meta name="keywords" content="博客, blog, 技术, 生活, Technology, Life">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
</head>
<body>
<div id="content">
<header>
<h1 class="title">为本地添加多个 GitHub 账户</h1>
</header><p>
重要参考：<a href="https://io-oi.me/tech/ssh-with-multiple-github-accounts/">使用
SSH 连接到 GitHub（多帐号）</a>
</p>

<div class="org-src-container">
<pre class="src src-shell">solve the hexo deploy problem:

Omit --global to set the identity only<span style="color: #91a0b3;"> in</span> this repository.

It tells me I must add the global user.name and user.email, but I didn<span style="color: #ddbc91;">'t want to do that. Then, I can'</span>t find the ways to solve it and I add the global configuration. However, it<span style="color: #ddbc91;">'s no use!</span>
</pre>
</div>

<p>
以上是我遇到的问题：在执行 <code>hexo deploy</code> 时报错。
</p>

<p>
根据提示，我应该把全局 <code>user.name</code> 和 <code>user.email</code> 改为我要提交的 GitHub
的账号信息。但是，这是不行的。因为我使用了两个 GitHub
账号，如果设置了全局的信息。本该是 A 账号的提交却变成 B 账号，此时
GitHub 的 commits
统计就不会显示非当前账号用户的提交，另外，如果你从别人的仓库 fork
到你自己的仓库，在本地提交给你自己的 forked 的仓库，也是无法显示 commits
提交的。
</p>

<p>
对于多个 GitHub 账号，网络中大多是在路径：=~/.ssh/= 下新建文件名为
<code>config</code> 。并在其中写入以下下内容：
</p>

<pre class="example" id="org3c790ee">
# Personal account, - the default config
Host github.com
   HostName github.com
   User git
   IdentityFile ~/.ssh/id_rsa

# Work account-1
Host github.com-work_user1    
   HostName github.com
   User git
   IdentityFile ~/.ssh/id_rsa_work_user1
</pre>

<p>
但是，我发现这样做无法解决问题，即便在设置全局变量之后。
</p>

<p>
我再次搜索，发现可以为当前仓库单独设置变量，即使用命令：
</p>

<div class="org-src-container">
<pre class="src src-shell">git config --local user.name <span style="color: #ddbc91;">""</span>
git config --local user.email <span style="color: #ddbc91;">""</span>
</pre>
</div>

<p>
在引号中输入你的 GitHub 账号 id
和对应的用于登录的邮箱。此时，你的提交信息就会显示你的名字和你的邮箱。
</p>

<p>
之后，我发现这样做可行，能够在 GitHub 中显示我的提交。
</p>

<p>
至于 hexo deploy
问题的解决，我特别沮丧，因为我怎样设置，也没有办法解决。我尝试了：
</p>

<ol class="org-ol">
<li>设置 global 变量(user.name, user.email)</li>
<li>设置 local 变量(user.name, user.email)</li>
<li>配置 config</li>
</ol>

<p>
最后，在尝试完了以上步骤之后，我发现：=hexo deploy= 和
<code>git push origin master</code> 有很大区别。
</p>

<p>
前者是将 public
文件夹的内容推送至目标仓库，后者是将本地仓库所有内容推送至目标仓库。前者能在目标仓库生成网页，后者却不能。这样的收获也算是意外所得。
</p>

<p>
经过这一系列的过程之后，我发现：自己再也无法使用 hexo 了，于是我全心投入
hugo 的怀抱。
</p>

<hr>

<p>
参考链接：
</p>

<ol class="org-ol">
<li><a href="https://www.fofxacademy.com/how-to-setup-git-on-your-pc-for-multiple-github-accounts/">https://www.fofxacademy.com/how-to-setup-git-on-your-pc-for-multiple-github-accounts/</a></li>
<li><a href="https://www.freecodecamp.org/news/manage-multiple-github-accounts-the-ssh-way-2dadc30ccaca/">https://www.freecodecamp.org/news/manage-multiple-github-accounts-the-ssh-way-2dadc30ccaca/</a>
(理解更清晰)</li>
</ol>
</div>
</body>
</html>